src/cf/InformationRegisters/узАктивностиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>узАктивностиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узИсторияКонфигураций</v8:Type>
						<v8:Type>cfg:DocumentRef.узВыпускРелиза</v8:Type>
						<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.узВопросыОтветы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.узВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/узНастройкиДляСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>узНастройкиДляСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеРегистрироватьАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатусИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узСтатусыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узСтатусыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/узВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>узВидыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавленаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавленКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененоОписаниеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавленВопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытВопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданДокументВыпускРелиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведенДокументВыпускРелиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаКонфигурация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/узВыпускРелиза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>узВыпускРелиза</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗадач</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияХранилища</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьИсторииХранилища</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узИсторияКонфигураций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узИдентификаторыОбъектовМетаданныхКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/узИсторияКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>узИсторияКонфигураций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.узКонфигурации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИзменения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.узВидыИзменений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узИдентификаторыОбъектовМетаданныхКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/узАктивностиПользователей/Ext/ManagerModule.bsl
Процедура ДобавитьАктивностьПользователя(Источник, ДопПараметры,Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	Конецесли;
	
	Если Константы.узРегистрироватьАктивностьПользователей.Получить() = Ложь Тогда
		Возврат;
	Конецесли;
	
	ТипЗнчИсточник = ТипЗнч(Источник);
	
	Если ТипЗнчИсточник = Тип("СправочникОбъект.узЗадачи") Тогда
		ДобавитьАктивностьПользователя_Задачи(Источник, ДопПараметры,Отказ);
	ИначеЕсли ТипЗнчИсточник = Тип("СправочникОбъект.узВопросыОтветы") Тогда
		ДобавитьАктивностьПользователя_ВопросыОтветы(Источник, ДопПараметры,Отказ);
	ИначеЕсли ТипЗнчИсточник = Тип("СправочникОбъект.узИсторияКонфигураций") Тогда
		ДобавитьАктивностьПользователя_ИсторияКонфигураций(Источник, ДопПараметры,Отказ);		
	ИначеЕсли ТипЗнчИсточник = Тип("ДокументОбъект.узВыпускРелиза") Тогда
		ДобавитьАктивностьПользователя_ВыпускРелиза(Источник, ДопПараметры,Отказ);
	Иначе
		ВызватьИсключение "Ошибка! нет алгоритма для регистрации активности пользователя";
	Конецесли;
	
КонецПроцедуры 

Процедура ДобавитьАктивностьПользователя_ИсторияКонфигураций(Источник, ДопПараметры,Отказ)
	#Если Тромбон тогда
		Источник = Справочники.узИсторияКонфигураций.СоздатьЭлемент();
	#Конецесли
	ВидыСобытий_ИзмененаКонфигурация = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ИзмененаКонфигурация");
	
	пДатаАктивности = Источник.ДатаВерсии;
	пСсылкаНаОбъект = Источник.Ссылка;
	пПользователь = Источник.Пользователь;
	
	ПредставлениеЗадачи	= "";	
	пЗадача = Источник.Задача;
	Если ЗначениеЗаполнено(пЗадача) Тогда
		ПредставлениеЗадачи = "#" + Формат(пЗадача.Код,"ЧГ=0") + " " + пЗадача;
	Конецесли;
	
	пОписание = "" + ВидыСобытий_ИзмененаКонфигурация;
	Если ЗначениеЗаполнено(пЗадача) Тогда
		пОписание = "" + ВидыСобытий_ИзмененаКонфигурация + " по задаче " + ПредставлениеЗадачи; 
	Конецесли;
	
	НаборЗаписей = РегистрыСведений.узАктивностиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(пСсылкаНаОбъект);
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.ДатаАктивности = пДатаАктивности;
	Запись.СсылкаНаОбъект = пСсылкаНаОбъект;
	Запись.Пользователь = пПользователь;
	Запись.ВидСобытия = ВидыСобытий_ИзмененаКонфигурация;			
	Запись.Описание = пОписание;
	Запись.ДеньАктивности = НачалоДня(пДатаАктивности);
	
	НаборЗаписей.Записать();
КонецПроцедуры 

Процедура ДобавитьАктивностьПользователя_ВыпускРелиза(Источник, ДопПараметры,Отказ)
	#Если Тромбон тогда
		Источник = Документы.узВыпускРелиза.СоздатьДокумент();
	#Конецесли
	ТЗСобытия = ДопПараметры.ТЗСобытия;
	
	НомерРелиза	= "" + Источник.НомерРелиза;
	
	ВидыСобытий_СозданДокументВыпускРелиза = ПредопределенноеЗначение("Перечисление.узВидыСобытий.СозданДокументВыпускРелиза");
	ВидыСобытий_ПроведенДокументВыпускРелиза = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ПроведенДокументВыпускРелиза");
	
	МассивВидовСобытияДляРегистрацииАктивности = Новый Массив();
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_СозданДокументВыпускРелиза);
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_ПроведенДокументВыпускРелиза);
	
	Для каждого СтрокаТЗСобытия из ТЗСобытия цикл
		пВидСобытия = СтрокаТЗСобытия.ВидСобытия;
		Если МассивВидовСобытияДляРегистрацииАктивности.Найти(пВидСобытия) = Неопределено Тогда
			Продолжить;
		Конецесли;
		
		МенеджерЗаписи = РегистрыСведений.узАктивностиПользователей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ДатаАктивности = ТекущаяДата();
		МенеджерЗаписи.ДеньАктивности = НачалоДня(МенеджерЗаписи.ДатаАктивности);
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.СсылкаНаОбъект = Источник.Ссылка;
		МенеджерЗаписи.ВидСобытия = пВидСобытия;
		
		МенеджерЗаписи.Описание = "" + пВидСобытия + " НомерРелиза " + НомерРелиза; 
		МенеджерЗаписи.Записать();
	Конеццикла;
	
КонецПроцедуры 

Процедура ДобавитьАктивностьПользователя_ВопросыОтветы(Источник, ДопПараметры,Отказ)
	#Если Тромбон тогда
		Источник = Справочники.узВопросыОтветы.СоздатьЭлемент();
	#Конецесли
	ТЗСобытия = ДопПараметры.ТЗСобытия;
	
	ПредставлениеЗадачи	= "";
	пЗадача = Источник.Задача;
	Если ЗначениеЗаполнено(пЗадача) Тогда
		ПредставлениеЗадачи = "#" + Формат(пЗадача.Код,"ЧГ=0") + " " + пЗадача;
	Конецесли;
	
	ВидыСобытий_ДобавленВопрос = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ДобавленВопрос");
	ВидыСобытий_ЗакрытВопрос = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ЗакрытВопрос");
	
	МассивВидовСобытияДляРегистрацииАктивности = Новый Массив();
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_ДобавленВопрос);
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_ЗакрытВопрос);
	
	Для каждого СтрокаТЗСобытия из ТЗСобытия цикл
		пВидСобытия = СтрокаТЗСобытия.ВидСобытия;
		Если МассивВидовСобытияДляРегистрацииАктивности.Найти(пВидСобытия) = Неопределено Тогда
			Продолжить;
		Конецесли;
		
		МенеджерЗаписи = РегистрыСведений.узАктивностиПользователей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ДатаАктивности = ТекущаяДата();
		МенеджерЗаписи.ДеньАктивности = НачалоДня(МенеджерЗаписи.ДатаАктивности);
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.СсылкаНаОбъект = Источник.Ссылка;
		МенеджерЗаписи.ВидСобытия = пВидСобытия;
		
		Если ЗначениеЗаполнено(пЗадача) Тогда
			МенеджерЗаписи.Описание = "" + пВидСобытия + " к задаче " + ПредставлениеЗадачи; 
			Если пВидСобытия = ВидыСобытий_ЗакрытВопрос Тогда
				МенеджерЗаписи.Описание = "" + пВидСобытия + " по задаче " + ПредставлениеЗадачи; 
			Конецесли;
		Иначе
			МенеджерЗаписи.Описание = "" + пВидСобытия;	
		Конецесли;
		МенеджерЗаписи.Записать();
	Конеццикла;
	
КонецПроцедуры 

Процедура ДобавитьАктивностьПользователя_Задачи(Источник, ДопПараметры,Отказ)
	#Если Тромбон тогда
		Источник = Справочники.узЗадачи.СоздатьЭлемент();
	#Конецесли
	
	СобытияВИстории = ДопПараметры.СобытияВИстории;
	
	СтарыйСтатус = СобытияВИстории.СтарыйСтатус;
	НовыйСтатус = Источник.Статус;
	
	РегистрироватьАктивность = ПолучитьРегистрироватьАктивность_Задачи(СтарыйСтатус,НовыйСтатус);
	
	Если НЕ РегистрироватьАктивность Тогда
		Возврат;
	Конецесли;
	
	ТЗСобытияВИсторииДляУведомлений = СобытияВИстории.ТЗСобытияВИсторииДляУведомлений;
	
	ВидыСобытий_ДобавленаЗадача = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ДобавленаЗадача");
	ВидыСобытий_ИзменениеСтатуса = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ИзменениеСтатуса");
	ВидыСобытий_ДобавленКомментарий = ПредопределенноеЗначение("Перечисление.узВидыСобытий.ДобавленКомментарий");
	
	МассивВидовСобытияДляРегистрацииАктивности = Новый Массив();
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_ДобавленаЗадача);
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_ИзменениеСтатуса);
	МассивВидовСобытияДляРегистрацииАктивности.Добавить(ВидыСобытий_ДобавленКомментарий);
	
	Для каждого СтрокаТЗСобытияВИсторииДляУведомлений из ТЗСобытияВИсторииДляУведомлений цикл
		пВидСобытия = СтрокаТЗСобытияВИсторииДляУведомлений.ВидСобытия;
		Если МассивВидовСобытияДляРегистрацииАктивности.Найти(пВидСобытия) = Неопределено Тогда
			Продолжить;
		Конецесли;
		
		МенеджерЗаписи = РегистрыСведений.узАктивностиПользователей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ДатаАктивности = ТекущаяДата();
		МенеджерЗаписи.ДеньАктивности = НачалоДня(МенеджерЗаписи.ДатаАктивности);
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.СсылкаНаОбъект = Источник.Ссылка;
		МенеджерЗаписи.ВидСобытия = пВидСобытия;
		
		ПредставлениеЗадачи = "#" + Формат(Источник.Код,"ЧГ=0") + " " + МенеджерЗаписи.СсылкаНаОбъект;
		МенеджерЗаписи.Описание = "" + пВидСобытия + " " + ПредставлениеЗадачи; 
		Если пВидСобытия = ВидыСобытий_ДобавленКомментарий Тогда
			МенеджерЗаписи.Описание = "" + пВидСобытия + " к задаче " + ПредставлениеЗадачи; 
		ИначеЕсли пВидСобытия = ВидыСобытий_ИзменениеСтатуса Тогда
			МенеджерЗаписи.Описание = "Новый статус ["+НовыйСтатус+"] у задачи " + ПредставлениеЗадачи; 
		Конецесли;
		МенеджерЗаписи.Записать();
	Конеццикла;
	
КонецПроцедуры 

Функция ПолучитьРегистрироватьАктивность_Задачи(СтатусИсточник,СтатусПриемник) 
	пРегистрироватьАктивность = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	узНастройкиДляСтатусов.СтатусИсточник,
	|	узНастройкиДляСтатусов.СтатусПриемник,
	|	узНастройкиДляСтатусов.НеРегистрироватьАктивность
	|ИЗ
	|	РегистрСведений.узНастройкиДляСтатусов КАК узНастройкиДляСтатусов
	|ГДЕ
	|	узНастройкиДляСтатусов.СтатусИсточник = &СтатусИсточник
	|	И узНастройкиДляСтатусов.СтатусПриемник = &СтатусПриемник";
	
	Запрос.УстановитьПараметр("СтатусИсточник", СтатусИсточник);
	Запрос.УстановитьПараметр("СтатусПриемник", СтатусПриемник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеРегистрироватьАктивность Тогда
			пРегистрироватьАктивность = Ложь;	
		Конецесли;
	КонецЦикла;
	
	Возврат пРегистрироватьАктивность;
КонецФункции
